In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = {
    'Country':['Belgium', 'India', 'Brazil'],
    'Capital':['Brussels', 'New Delhi', 'Brasilia'],
    'Population':[1190846, 1303171035, 207845528]
}

### Series

In [4]:
s1 = pd.Series(data['Country'])
s1

0    Belgium
1      India
2     Brazil
dtype: object

In [5]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [7]:
type(s1.values)

numpy.ndarray

In [8]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
s1 = pd.Series(data['Country'], index=['A', 'B', 'C'])
s1

A    Belgium
B      India
C     Brazil
dtype: object

### DataFrame

In [12]:
df1 = pd.DataFrame(data)
df1

   Country    Capital  Population
0  Belgium   Brussels     1190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207845528

In [14]:
cou = df1['Country']

In [15]:
type(cou)

pandas.core.series.Series

生成迭代器

In [16]:
cou.iteritems()

In [22]:
for row in df1.iterrows():
    print(row), print(type(row)), print(len(row))

(0, Country        Belgium
Capital       Brussels
Population     1190846
Name: 0, dtype: object)
<class 'tuple'>
2
(1, Country            India
Capital        New Delhi
Population    1303171035
Name: 1, dtype: object)
<class 'tuple'>
2
(2, Country          Brazil
Capital        Brasilia
Population    207845528
Name: 2, dtype: object)
<class 'tuple'>
2

In [26]:
for row in df1.iterrows():
    print(row[0]), print(row[1])
    print(type(row[0])), print(type(row[1]))
    break

0
Country        Belgium
Capital       Brussels
Population     1190846
Name: 0, dtype: object
<class 'int'>
<class 'pandas.core.series.Series'>

In [27]:
df1

   Country    Capital  Population
0  Belgium   Brussels     1190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207845528

In [28]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [1190846, 1303171035, 207845528]}

In [35]:
s1 = pd.Series(data['Country'])
s2 = pd.Series(data['Capital'])
s3 = pd.Series(data['Population'])

In [44]:
df_new = pd.DataFrame([s1, s2, s3])
df_new

          0           1          2
0   Belgium       India     Brazil
1  Brussels   New Delhi   Brasilia
2   1190846  1303171035  207845528

In [45]:
df1

   Country    Capital  Population
0  Belgium   Brussels     1190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207845528

In [46]:
df_new = df_new.T

In [47]:
df_new

         0          1           2
0  Belgium   Brussels     1190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207845528

In [48]:
df1

   Country    Capital  Population
0  Belgium   Brussels     1190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207845528

In [52]:
df_new = pd.DataFrame([s1, s2, s3], index = ['Country', 'Capital', 'Population'])
df_new

                   0           1          2
Country      Belgium       India     Brazil
Capital     Brussels   New Delhi   Brasilia
Population   1190846  1303171035  207845528

In [53]:
df_new = df_new.T
df_new

   Country    Capital  Population
0  Belgium   Brussels     1190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207845528

In [54]:
df1

   Country    Capital  Population
0  Belgium   Brussels     1190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207845528